// Приклад 1
#include <stdio.h>
void main(){
	int x = 99;
	int *p1,*p2;
	p1 = &x;
	p2 = p1;
	printf("Znachennya po adresi p1 i p2: %d %d\n",*p1,*p2);
	printf("Znachennya vkazivnukiv p1 i p2: %p %p\n",p1,p2);}
// -------------------------------------------------------------------------------------------------
// Znachennya po adresi p1 i p2: 99 99
// Znachennya vkazivnukiv p1 i p2: 000000000065FE0C 000000000065FE0C

// 3. Написати программу для визначення суми масиву, який складається з п’яти елементів. 
// Значення елементів вводяться з клавіатури. Для доступу до елементів масиву використати вказівник. 
// Представити скріни коду програми та результати її виконання у звіті.
#include <stdio.h>
void main(){
	int a[5];
	int sum=0;
	for (int i=0;i<5;i++){
		scanf("%d",&a[i]);
	}
	for(int j=0;j<5;j++){
		int c = *(a+j);
		sum = sum + c;
	}
	printf("sum = %d",sum);
}
// --------------------------------------------------------------------------------------------------
// 1
// 2
// 3
// 4
// 5
// sum = 15

