// Завдання 1
// Приклад 1
#include<stdio.h>
void main(){
	int z,w;
	int x = 1;
	int y = 2;
	z = x + y;
	w = y - x;
	printf("z = %d, w = %d",z,w); 
}
----------------------------------------------------------------------------------------------------------------
// z = 3, w = 1
  
// Приклад 2
#define PI 3,14159
#include<stdio.h>
#include<windows.h>
void main(){
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	int a = 5;
	float b = 23.5;
	int c = 31000;
	printf("%d метрів тканини коштувало %.2f гривень\n",a,b);
	printf("Значення числа PI %f\n",a,b);
	printf("IBM сумісні комп'ютери набули широкого розповсюдження.\n");
	printf("%c%d",'&',c);
}
----------------------------------------------------------------------------------------------------------------
// 5 метрів тканини коштувало 23.50 гривень
// Значення числа PI 0.000000
// IBM сумісні комп'ютери набули широкого розповсюдження.
// &31000

// Приклад 3
#include<stdio.h>
void main(){
	printf("/%d/\n",557);
	printf("/%10d/\n",557);
	printf("/%-10d/\n",557);
}
----------------------------------------------------------------------------------------------------------------
// /557/
// /       557/
// /557       /

// Приклад 4
#include<stdio.h>
void main(){
	printf("%d\n",557);
	printf("%o\n",557);
	printf("%x\n",557);
	printf("%d\n",-557);
}
----------------------------------------------------------------------------------------------------------------
// 557
// 1055
// 22d
// -557
  
// Приклад 5
#include<stdio.h>
#include<windows.h>
void main(){
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	int vik;
	char name[30];
	printf("Ваш вік?  ");
	scanf("%d",&vik);
	printf("Введіть ваше ім'я  ");
	scanf("%s",&name);
	printf("Привіт %s якому %d років",name,vik);
}
----------------------------------------------------------------------------------------------------------------
// Ваш вік?  19
// Введіть ваше ім'я  Василь
// Привіт Василь якому 19 років
  
// Приклад 6
#define STOP '*'
#include<stdio.h>
void main(){
	char ch;
	ch = getchar();
	if (ch != STOP){
		putchar(ch);
		main();}}
----------------------------------------------------------------------------------------------------------------
// 123abc
// 123abc
// *
  
// Завдання 4
 #include<stdio.h>
void main(){
    char ch[10]= "ABCDEFG123";
    for(int i; i < 10; i++){
        printf("%c - %d - %-3o - %x\n",ch[i],ch[i],ch[i],ch[i]);
    }
}
----------------------------------------------------------------------------------------------------------------
// A - 65 - 101 - 41
// B - 66 - 102 - 42
// C - 67 - 103 - 43
// D - 68 - 104 - 44
// E - 69 - 105 - 45
// F - 70 - 106 - 46
// G - 71 - 107 - 47
// 1 - 49 - 61  - 31
// 2 - 50 - 62  - 32
// 3 - 51 - 63  - 33
  
// Завдання 6
 #include<stdio.h>
#define PI 3.14159
void main(){
    float r,P,S;
    scanf("%f",&r);
    if (r == 0){
        return 0;}
    P = 2*PI*r;
    S = PI*r*r;
    printf("P = %.2f\nS = %.2f\n",P,S);
    main();
}
----------------------------------------------------------------------------------------------------------------
// 2
// P = 12.57
// S = 12.57

// Завдання 7
#include <stdio.h>
#include <windows.h>
#include <math.h>
void main(){
    SetConsoleCP(65001);
    SetConsoleOutputCP(65001);
    float a,b,c,D,x,x1,x2;
    printf("Введіть коефіцієнт при x*2: ");
    scanf("%f",&a);
    if (a==0){
         return 0; }
    printf("Введіть коефіцієнт при x: ");
    scanf("%f",&b);
    printf("Введіть вільний коефіцієнт: ");
    scanf("%f",&c) ;
    D = b*b-(4*a*c);
    if (D<0){
        printf("Квадратне рівняння немає дійсних коренів\n\n");
        main(); }
    else if(D==0){
        x = -b/2*a;
        printf("Рівняння має лише один корінь X = %.2f\n\n",x);
        main(); }
    else if(D>0){
        x1 = (-b-sqrt(D))/(2*a);
        x2 = (-b+sqrt(D))/(2*a);
        printf("Перший корінь X1 = %.2f\n",x1);
        printf("Другий корінь X2 = %.2f\n\n",x2);
        main(); }
}
----------------------------------------------------------------------------------------------------------------
// Введіть коефіцієнт при x*2: 1
// Введіть коефіцієнт при x: 1
// Введіть вільний коефіцієнт: 1
// Квадратне рівняння немає дійсних коренів

// Введіть коефіцієнт при x*2: 1
// Введіть коефіцієнт при x: 4
// Введіть вільний коефіцієнт: 1
// Перший корінь X1 = -3.73
// Другий корінь X2 = -0.27

// Введіть коефіцієнт при x*2: 2
// Введіть коефіцієнт при x: 4
// Введіть вільний коефіцієнт: 2
// Рівняння має лише один корінь X = -4.00
  
// Завдання 8
#include <stdio.h>
#include <windows.h>
#define STOP '*'
int main(){
    SetConsoleCP(65001);
    SetConsoleOutputCP(65001);
    char ch = getchar();
    if (ch != STOP){
       putchar(ch);
        main();
    }
    else {
        Beep(400,900);
        return 0;}}
----------------------------------------------------------------------------------------------------------------
// 1
// 1
// a
// a
// *
  
// Завдання 9 
#include <stdio.h>
#include <windows.h>
#include <math.h>
int main(){
    SetConsoleCP(65001);
    SetConsoleOutputCP(65001);
    float Ax,Ay,Bx,By,Cx,Cy;
    Ax = 1;
    Ay = 1;
    Bx = 16;
    By = 15;
    Cx = -16;
    Cy = 10;
    float a,b,c,P,p,S,r;
    a = sqrt((Ax-Bx)*(Ax-Bx)+(Ay-By)*(Ay-By));
    b = sqrt((Bx-Cx)*(Bx-Cx)+(By-Cy)*(By-Cy));
    c = sqrt((Cx-Ax)*(Cx-Ax)+(Cy-Ay)*(Cy-Ay));
    P = a+b+c;
    p = P/2;	
    S = sqrt(p*(p-a)*(p-b)*(p-c));
    r = S/p;
    printf("Периметр трикутника P = %.2f\n",P);
    printf("Площа трикутника S = %.2f\n",S);
    printf("Раліус вписаного колаr = %.2f",r);
}
----------------------------------------------------------------------------------------------------------------
// Периметр трикутника P = 72.14
// Площа трикутника S = 186.50
// Радіус вписаного кола r = 5.17

// Завдання 10
#include <stdio.h>
#include <windows.h>
void main(){
    SetConsoleCP(65001);
    SetConsoleOutputCP(65001);
    float a, b, c, d, e, f, g, h, k, x, y, z, result;
    a = 100;
    b = 0.001;
    c = (a+b)*(a+b)*(a+b)*(a+b); //c = (a+b)^4
    d = a*a*a*a; //d = a^4
    e = a*a*a; //e = a^3
    f = a*a; //f = a^2
    g = b*b; //g = b^2
    h = b*b*b; //h = b^3
    k = b*b*b*b; //k = b^4
    x = 4*e*b;
    y = 6*f*g;
    z = 4*a*h;
    result = (c-(d+x+y))/z+k;
    printf("Результат = %.2f",result);
}
----------------------------------------------------------------------------------------------------------------
// Результат = 0.00

