// ЗАВДАННЯ
// 1. Здійснити виконання програми VALUES.C:
#include <stdio.h>
#include <conio.h>
#include<windows.h>
int main(){
SetConsoleCP(65001);
SetConsoleOutputCP(65001);
printf("Числа типу int займають %d байт.\n",sizeof(int));
printf("Числа типу char займають %d байт.\n",sizeof(char));
printf("Числа типу float займають %d байт.\n",sizeof(float));
printf("Числа типу double займають %d байт.\n",sizeof(double));
getch();
}
// -------------------------------------------------------------------------------------------------------
// Числа типу int займають 4 байт.
// Числа типу char займають 1 байт.
// Числа типу float займають 4 байт.
// Числа типу double займають 8 байт.

// 2. Створити і виконати програми дослідження властивостей арифметичних 
// операцій iз різними типами величин. 
// Префіксний та постфіксний інкремент ++ і декремент --
#include <stdio.h>
#include <conio.h>
int main()
{ int n = 1;
 printf("n=%d \n",n);
// n++;
 printf("prefix: ++n=%d\n",++n);
 printf("postfix: n++=%d\n",n++);
 printf("after-postfix: n=%d\n",n);
// n--;
 printf("prefix: --n=%d\n",--n);
 printf("postfix: n--=%d\n",n--);
 printf("after-postfix: n=%d\n",n);
 }
// -------------------------------------------------------------------------------------------------------
// n=1
// prefix: ++n=2
// postfix: n++=2
// after-postfix: n=3
// prefix: --n=2
// postfix: n--=2
// after-postfix: n=1

// 3. Виконати завдання згідно варіанта і пояснити результат при n=1, m=1.
// (Варіант 8)
int main(){
 int n=1,m=1,res1,res2;
 res1=n++-m;
 printf("res1=%d\n",res1);
 res2= m-- *n;
printf("res2=%d",res2);
 return 0;
}
// -------------------------------------------------------------------------------------------------------
// res1=0
// res2=2

// 4. Виконати приклади і пояснити результати
// 4.1
#include <stdio.h>
int main()
{ int a, b=3;
float c;
c = b%2 + (a = ++b/2) + 1.1;
printf("a=%d, c=%4.1f\n",a,c); }
// -------------------------------------------------------------------------------------------------------
// a=2, c= 4.1

// 4.2
#include <stdio.h>
int main()
{
int x=2,z;
float y = 2.1;
z = x++*y + y/x*3; 
printf("x=%d z=%d\n",x,z);}
// -------------------------------------------------------------------------------------------------------
// x=3 z=6

// 4.3
#include <stdio.h>
int main()
{
float x = 1.1, y = 0, z;
int a;
z = (a=x++)*y + 3*x; 
printf("z=%4.1f\n",z);}
// -------------------------------------------------------------------------------------------------------
// z= 6.3

