//Приклад 1
#include<stdio.h>
void main(){
	int z,w;
	int x = 1;
	int y = 2;
	z = x + y;
	w = y - x;
	printf("z = %d, w = %d",z,w); 
}
----------------------------------------------------------------------------------------------------------------
//z = 3, w = 1
  
//Приклад 2
#define PI 3,14159
#include<stdio.h>
#include<windows.h>
void main(){
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	int a = 5;
	float b = 23.5;
	int c = 31000;
	printf("%d метрів тканини коштувало %.2f гривень\n",a,b);
	printf("Значення числа PI %f\n",a,b);
	printf("IBM сумісні комп'ютери набули широкого розповсюдження.\n");
	printf("%c%d",'&',c);
}
----------------------------------------------------------------------------------------------------------------
// 5 метрів тканини коштувало 23.50 гривень
// Значення числа PI 0.000000
// IBM сумісні комп'ютери набули широкого розповсюдження.
// &31000
  
// Приклад 3
#include<stdio.h>
void main(){
	printf("/%d/\n",557);
	printf("/%10d/\n",557);
	printf("/%-10d/\n",557);
}
----------------------------------------------------------------------------------------------------------------
// /557/
// /       557/
// /557       /

// Приклад 4
#include<stdio.h>
void main(){
	printf("%d\n",557);
	printf("%o\n",557);
	printf("%x\n",557);
	printf("%d\n",-557);
}
----------------------------------------------------------------------------------------------------------------
// 557
// 1055
// 22d
// -557
  
// Приклад 5
#include<stdio.h>
#include<windows.h>
void main(){
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	int vik;
	char name[30];
	printf("Ваш вік?  ");
	scanf("%d",&vik);
	printf("Введіть ваше ім'я  ");
	scanf("%s",&name);
	printf("Привіт %s якому %d років",name,vik);
}
----------------------------------------------------------------------------------------------------------------
// Ваш вік?  19
// Введіть ваше ім'я  Василь
// Привіт Василь якому 19 років

//Приклад 6
#define STOP '*'
#include<stdio.h>
void main(){
	char ch;
	ch = getchar();
	if (ch != STOP){
		putchar(ch);
		main();}}
----------------------------------------------------------------------------------------------------------------
// 123abc
// 123abc
// *

