// Приклад 1
 #include <stdio.h> 
int main() { 
int a=67; 
int b=33; 
int c = a+b+7; 
printf("a+b+7 =%d\n", c); 
return 0; 
}
// -------------------------------------------------------------------------------------------------------
// a+b+7 =107

// Приклад 2
#include <stdio.h> 
int main() { 
int a=38; 
int b=7; 
int c=a+5*b; 
printf("c = %d \n", c); 
}
 // ------------------------------------------------------------------------------------------------------
// c = 73

// Приклад 3
 #include <stdio.h> 
int main() { 
int a=8; 
int b=7; 
int c=(a+5)*b;
printf("c = %d \n", c); 
}
 // ------------------------------------------------------------------------------------------------------
// c = 91

// Приклад 4
#include <stdio.h> 
int main() { 
int a=8: 
int b=++a; 
printf{("a=2%d \n", a); 
printf("b=%d",b); 
} 
 // ------------------------------------------------------------------------------------------------------
// a=29
// b=9

// Приклад 5
 #include <stdio.h> 
int main() { 
int a=8; 
int b=a++; 
printf("a=%d\n", a); 
printf("b=%d", b);
}
 // ------------------------------------------------------------------------------------------------------
// a=9
// b=8

// Приклад 6
#include <stdio.h> 
int main() { 
int a=8; 
int b=a--; 
printf("a=%d\n", a); 
printf("b=%d", b);
}
 // ------------------------------------------------------------------------------------------------------
// a=7
// b=8

// Приклад 7
#include <stdio.h> 
int main() { 
int a=8; 
int b=--a; 
printf("a=%d\n", a); 
printf("b=%d", b);
}
 // ------------------------------------------------------------------------------------------------------
// a=7
// b=7

// Завдання 3
#define PRAISE "O, яке чудове ім'я!" 
#include <stdio.h> 
#include <string.h> 
#include<windows.h>
int main()  { 
SetConsoleCP(65001);
SetConsoleOutputCP(65001);
char name[50]; 
printf("Як Вас звати?\n"); scanf("%s",name); 
printf("Привіт, %s. %s\n",name,PRAISE); 
printf("Ваше ім'я складається з %d літер і займає %d комірок пам'яті\n", strlen(name)/2, sizeof name); 
printf("Вітальна фраза складається 3 %d літер", strlen (PRAISE)/2); 
printf(" i займає %d комірок пам'ятi\n", sizeof PRAISE); }
// -------------------------------------------------------------------------------------------------------
// Як Вас звати?
// Василь
// Привіт, Василь. O, яке чудове ім'я!
// Ваше ім'я складається з 6 літер і займає 50 комірок пам'яті
// Вітальна фраза складається 3 15 літер i займає 32 комірок пам'ятi

// Завдання 4
#include <stdio.h> 
#include <conio.h> 
void main() { 
float x=1.4, y=2.0; int z; 
z = x/2*7 + y/4 - 1; 
printf("z=%d\n",--z); 
getch(); 
} 
// -------------------------------------------------------------------------------------------------------
// z = 3

#include <stdio.h> 
#include <conio.h> 
void main() { 
int x=2,z; 
float y; 
z=0.5*(y = 2.3*x) + x++/3*y;
getch(); 
} 
// -------------------------------------------------------------------------------------------------------
 // z = 2

 #include <stdio.h> 
#include <conio.h> 
void main() { 
int x,y=3; 
float z; 
z=1.1*(x=++y/2.)+ 0.3*x; 
printf("z=%4.1f\n",z); 
getch(); 
} 
// -------------------------------------------------------------------------------------------------------
 // z = 2.8

